In [1]:
import numpy as np
import pandas as pd

In [2]:
myData = {'me':[3,5,np.NaN] , 'mf': [4,np.NaN,np.NaN], 'mof': [3,5,4]}

In [3]:
myDataFrame = pd.DataFrame(myData)
myDataFrame

    me   mf  mof
0  3.0  4.0    3
1  5.0  NaN    5
2  NaN  NaN    4

In [4]:
myDataFrame.fillna(value=myDataFrame['me'].mean())

    me   mf  mof
0  3.0  4.0    3
1  5.0  4.0    5
2  4.0  4.0    4

# Video 2

In [5]:
newData = {
    'Movies' : ['Star-Wars', 'Star-Wars', 'Batman','Batman', 'Deadpool', 'Deadpool'],
    'Viewers': ['Me', 'MF', 'MOF', 'Bobby','Dean', 'Sammy'],
    'Ratings': [10,7,6,9,8,5]
}

In [6]:
movieFrame = pd.DataFrame(newData)
movieFrame

      Movies Viewers  Ratings
0  Star-Wars      Me       10
1  Star-Wars      MF        7
2     Batman     MOF        6
3     Batman   Bobby        9
4   Deadpool    Dean        8
5   Deadpool   Sammy        5

In [7]:
movieFrame.groupby('Movies').std().iloc[2]

Ratings    2.12132
Name: Star-Wars, dtype: float64

# Video 3